Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དོན་ཡོད་པའི་རྣམ་པར་གཟིགས་པ། དེ་བཞིན་གཤེགས་པ་པདྨ་གཙུག་ཏོར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བས་བྱིན་གྱིས་བརླབས་པ། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དང་། དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྙིང་པོས་བྱིན་གྱིས་བརླབས་པ། དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་འོད་ཀྱིས་བཀའ་སྩལ་པ།
en: It is gazed upon by all the tathāgatas, and it has been blessed by the tathāgata named Padmoṣṇīṣarāja, as well as by the Tathāgata Vairocana and the Tathāgata Ratnagarbha.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུས་གསུངས་ཤིང་བསྔགས་པ། བྱིན་གྱིས་བརླབས་པ། དབང་བསྐུར་བ། རྗེས་སུ་ཐུགས་རངས་པར་མཛད་པ། ལུང་བསྟན་པ།
en: It was taught by the Tathāgata Lokeśvaraprabha and by hundreds of thousands of millions of billions of other tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, who also taught it, extolled it, blessed it, consecrated it, rejoiced in it, and prophesied it. “

source: མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཙུག་ཏོར་གྱི་ནོར་བུ་ཅོད་པན་འཆང་བ།
en: This pill is the crest jewel of the noble protector Avalokiteśvara.

source: རྒྱལ་པོ་འོད་དཔག་མེད་ཀྱི་གཙུག་ཏོར་གྱི་མཚན་ཉིད་ཀྱི་ཐིག་ལེ་ཡིད་བཞིན་གྱི་ནོར་བུ་རྒྱལ་མཚན་གྱི་ནོར་བུ་ཆེན་པོའི་རྒྱལ་པོ་མཆོག་ཏུ་གྲུབ་པ།
en: It is the uṣṇīṣa bindi-mark that crowns the head of the victorious Amitābha. It is a banner mounted with a wish-fulfilling jewel. It is the great king of jewels that brings supreme accomplishment.

source: རིག་སྔགས་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཀྱི་གསང་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་སྤྱི།
en: It represents the secret maṇḍala, mudrā, and rites of all the vidyās, and it bestows the samaya bond equally with all the tathāgata families.

source: སྐུའི་སྙིང་པོ་གང་གིས་མཐོང་བ་ཙམ་ལ་སོགས་པ་འདིས་ཚད་བསྟན་པར་ལྟ་སུ་ཞིག་གིས་ནུས་མོད་ཀྱི། འོན་ཀྱང་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་དང་། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་རྫོགས་པར་མངོན་སུམ་དུ་མཐོང་བ་དང་འདྲ་བར་འགྱུར་ཞིང་།
en: The mere sight of this heart essence in physical form, seeing a single demonstration of its immensity, is the same as coming face-to-face with the tathāgatas of the three times in their millions, equaling in number the grains of sand in the Gaṅgā river.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཉིད་མངོན་སུམ་དུ་མཆོད་པར་གཟུང་བ་དང་ལུང་སྟོན་པ་འཐོབ་པར་འགྱུར།
en: It is the means by which the vidyā holder can worship all these tathāgatas directly, be accepted by them, and receive their prophecy about his future attainment of final emancipation.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མངོན་སུམ་དུ་དགེ་བའི་རྩ་བ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: By this direct communion with the tathāgatas, he will accumulate abundant merit and virtue. “

source: །ནོར་བུ་གསེར་གྱི་ཁ་དོག་ཏུ་བསྟན་པའི་རིལ་བུ་འདི་གང་གིས་མཐོང་ཞིང་འཆང་བ་ནི་དགེ་བའི་རྩ་བ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་བསྐྱེད་བསྐྱེད་པར་འགྱུར། ནོར་བུ་རིལ་བུ་འདི་མཐོང་བ་ཙམ་གྱིས་སྒྲིབ་པ་དང་། སྡིག་པ་དང་། གདུག་པ་དང་།
en: Anyone who sees or holds this precious pill, which is said to be of golden color, will accumulate great merit and plant roots of virtue.

source: མཚམས་མེད་པ་ལྔ་དང་། མནར་མེད་པར་གཞོལ་པ་དང་། དམ་པའི་ཆོས་སྤྲོད་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། སྔོན་གྱི་ཚེ་རབས་ནས་བསགས་པའི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འཇིག་ཅིང་སྤངས་པར་འགྱུར།
en: By merely looking at this precious pill, all evil, obscurations, and vice, including the five acts of immediate retribution that lead to rebirth in the Avīci hell, the offenses of rejecting the true Dharma and slandering the noble ones, and the obscurations accumulated in previous births, will be eradicated and come to an end.

source: རིམས་དང་། ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: All diseases and fevers will go away, and they will receive a prophecy of their future awakening. “

source: གང་གི་ལག་ན་སྨན་འདི་ཡོད་པར་གྱུར་པའི་སེམས་ཅན་དེ་ནི་ལུང་བསྟན་པར་འགྱུར་རོ། །རིལ་བུ་གང་ལ་ཡོད་པ་ནི། །ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་ཅིང་།
en: Any being in who places this remedy in their hand will attain the level of not turning back and will receive a prophecy about their future awakening.

source: །མགོན་པོ་ས་བཅུད་དག་ལ་གནས།
en: They will be established by the Protector on the ten bodhisattva levels.

source: །རྟག་ཏུ་མཆོད་རྟེན་གྱུར་པ་སྟེ། །སྐུ་གདུང་སྙིང་པོའི་བདག་ཉིད་ཅན།
en: If they rely on the pill, this great being will always be like a caitya that contains relics, their nature being that of a buddha.

source: །རྟག་ཏུ་སངས་རྒྱས་བདག་ཉིད་འགྱུར། །དུས་གསུམ་དག་ལ་ཞུགས་པ་ཡི། །སངས་རྒྱས་དེ་བཞིན་གཤེགས་པ་གང་། །སངས་རྒྱས་དཔའ་བོ་དེ་ཀུན་གྱི། །སྲས་གཅིག་ཏུ་ནི་བརྗོད་པ་ཡིན།
en: They will become the only son of each tathāgata established throughout the three times, a buddha-hero who dwells in the buddha fields.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྲས། །ཐུགས་ལས་སྐྱེས་དང་ཞལ་ལས་སྐྱེས། །ཆོས་ཀྱི་དབྱིངས་སྤྲུལ་ཆོས་ལས་སྐྱེས།
en: They will be the firstborn son of all the tathāgatas, born directly from their own flesh as a magical creation of the sphere of phenomena.

source: །འཇིག་རྟེན་དབང་ཕྱུག་མཆོག་སྦྱིན་མགོན། །རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར། །ཕྱག་གཡས་རྟག་ཏུ་སྤྱི་བོར་ནི།
en: The Lokeśvara will always bestow boons upon them and remain bound to them as a protector, always placing his right hand on their head.

source: །འཇོག་མཛད་འདི་ནི་ཐེ་ཙོམ་མེད།
en: There is no doubt about this. “

source: །རིལ་བུ་མཐོང་བ་ཙམ་གྱིས་ནི། །སྡུག་བསྔལ་ཀུན་ལས་རབ་ཏུ་གྲོལ། །སྡིག་པ་ཐམས་ཅད་རྣམ་པར་འཚེད། །སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འདག །
en: Upon merely seeing the pill, the vidyā holder will be freed from all his suffering; all his evil will be eradicated, and all his obscurations will be purified.

source: དེ་ནི་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །ཕྱིར་ཞིང་གནས་མཆོག་ཞི་བ་འཐོབ།
en: He will never again fall into the lower realms but will obtain the supremely auspicious state.

source: །འཇིག་རྟེན་འདྲེན་པ་འོད་དཔག་མེད། །མགོན་པོ་རྟག་ཏུ་མངོན་སུམ་མཐོང་། །བདེ་བ་ཅན་དུ་འཇུག་པར་བྱེད། །གང་ན་དེ་ཡི་མངོན་དགའ་བ།
en: If he is reborn in Sukhāvatī, he will always see Lord Amitābha, the guide of the world, face-to-face.

source: །དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ། །རྟག་ཏུ་མི་འཁྲུགས་པར་འགྱུར་ཞིང་། །དེ་བཞིན་མི་གཡོ་མི་འགུལ་ཏེ། །སེམས་དཔའ་རི་རབ་ཆེ་དང་མཉམ།
en: If he is reborn in Abhirati, where the Tathāgata Akṣobhya resides, he will be as unshakable, unwavering, and steadfast as the great Mount Sumeru.

source: །གཟུང་དུ་མེད་པས་མཆོ་དང་འདྲ།
en: Just like the ocean, he will be impossible to grasp. “

source: །དེ་ལ་བགེགས་དང་ལོག་འདྲེན་དག །ནམས་ཀྱང་འཇུག་པར་མི་འགྱུར་ལ། །སེམས་དཔའ་ཕྱག་བྱའི་གནས་སུ་འགྱུར། །གང་ལ་ནོར་རྒྱལ་འདི་ཡོད་ལ།
en: Those who reside where this pill, this king of jewels, is kept will never be troubled by vighnas or vināyakas but instead will become worthy of offerings.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག །དཔུང་དང་བཅས་པ་བཀོལ་དང་བཅས། །རྟག་ཏུ་བསྲུང་ཕྱིར་གནས་བྱེད་དེ། །འདིར་ནི་ཉིན་མཚན་དེ་བཞིན་ནོ། །ལྷ་ཚོགས་ཐམས་ཅད་བསྲུང་བར་ནི།
en: The Four Great Kings, with their troops and conveyances, will always be present to protect him day and night, and the full host of devas will protect him.

source: །ཐེ་ཚོམ་མེད་པར་བྱེད་པར་འགྱུར།
en: There is no doubt.

source: །གཟི་བརྗིད་དཔལ་ཡང་རབ་ཏུ་འཕེལ།
en: His splendor and fortune will increase, and his happiness in this world will continue.

source: །དེ་ལ་ལེགས་པར་འཇུག་པར་འགྱུར། །འཇིགས་མེད་རྟག་ཏུ་རྨི་ལམ་ནི། །དངོས་པོ་ཆེན་པོ་སྣ་ཚོགས་མཐོང་།
en: He will always have good dreams and experience various auspicious phenomena.

source: །གྲུ་འཛིན་རི་ལ་གཞལ་མེད་ཁང་། །ཚལ་དང་བཅས་ཤིང་རིན་ཆེན་བཅས། །གནས་དང་བཅས་པ་མཐོང་བར་འགྱུར། །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །དྲི་ཟ་ལྷ་མིན་གསང་བ་པ། །མ་མཁའ་ལྡིང་དག་མི་འམ་ཅི།
en: He will see Potala Mountain with its palaces, groves, residences, and precious objects, and he will see devas, nāgas, yakṣas, gandharvas, asuras, guhyakas, garuḍas, kinnaras, and mahoragas surrounded by their retinues. “

source: །དེ་བཞིན་ལྟོ་འཕྱེ་འཁོར་དང་བཅས། །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྣམས་ནི། །ཀུན་ནས་བསྐོར་བ་མཐོང་བར་འགྱུར། །རིན་ཆེན་ལྷ་ཡི་སེང་གེའི་གདན། །ཁང་པ་བརྩེགས་པ་རིན་ཆེན་དང་། །ནོར་བུ་ཆེན་པོས་བརྒྱན་པ་དང་། །འཇིག་རྟེན་དབང་ཕྱུག་ཐུབ་པའི་གཙོ། །པདྨའི་སྙིང་པོ་ལ་ཞུགས་ནས།
en: He will also see all around him assemblies of bodhisattvas with their retinues, as well as the Lokeśvara, the sagely teacher, giving the amogha teachings while seated on a lotus atop a jewel seat supported by lions inside a temple-palace adorned with divine jewels.

source: །དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱ་དང་། །དཀྱིལ་འཁོར་བཅས་པའི་ཆོས་སྟོན་ཏོ། །གསུང་ཀུན་ཐོབ་པར་གྱུར་ནས་ནི། །ཐུབ་པ་རང་གི་ངོ་བོ་མཐོང་།
en: He will hear him speak on the maṇḍala and mudrā and will see the Sage directly.

source: །དེ་ལྟར་རྨི་ལམ་བཟང་རྨི་བ། །ཉིན་གཅིག་བཞིན་དུ་མཐོང་བར་འགྱུར།
en: He will perceive this divine spectacle in his sleep every single night.

source: །ནོར་བུ་རྒྱལ་པོའི་མཐུ་ནི་དེ་འདྲ་བས།
en: Such is the power of this king of jewels.

source: །དེ་བས་མི་ཡིས་འབད་པ་ཆེན་པོས་ཟུང་།
en: One should therefore wear it with care. “

source: །དགེ་སྦྱོང་བྲམ་ཟེ་ཉིད་དང་རྒྱལ་རིགས་དང་། །དམངས་རིགས་ཉིད་དམ་ཡང་ན་རྒྱལ་པོ་འམ། །བཙུན་མོ་སླས་སམ་དཔུང་གི་གཙོ་བོ་འམ། །སྐྱེས་པ་འམ་བུད་མེད་ཁྱེའུ་དང་བུ་མོ་དག །ནོར་བུའི་རྒྱལ་པོ་རྟག་ཏུ་འཆང་བྱེད་པ། །དེ་ནི་སྟོན་པ་ཉིད་དང་འདྲ་བར་འགྱུར།
en: All ascetics, brahmins, kṣatriyas, vaiśyas, śūdras, kings with their harems and elite forces, women, men, boys, and girls should always wear this king of jewels, and they will become like the Teacher himself.

source: །ཆོམ་རྐུན་གྱིས་ནི་མི་སླུས་ཤིང་། །གནོད་བྱེད་ཀྱིས་ནི་འཇིགས་མི་འགྱུར། །འཇིག་པ་མི་བཟད་བརྒྱད་ལས་ཐར།
en: They will not fall victim to thieves or bandits and will be freed from the terrible eight fears.

source: །དེ་ལ་དུག་དང་སྦྱར་བའི་དུག །སྦྱར་དུག་དྲག་པོས་མི་ཚུགས་ཤིང་། །དེ་ལ་བྱད་ཀྱིས་ཚུགས་མི་འགྱུར། །གང་ལ་ནོར་བུའི་རྒྱལ་པོ་ཡོད།
en: Whoever wears this king of jewels or keeps it near them will not be harmed by poisons, venoms, magical poisoning, or kākhordas.

source: །དེ་ལ་ནད་ཀྱིས་མི་ཚུགས་ཤིང་། །ན་བས་མ་ཡིན་སྡིག་པས་མིན། །པདྨ་ཆུ་ཡིས་མི་ཆགས་ལྟར། །རྟག་ཏུ་ཆགས་པ་མེད་པར་གནས། །གཡུལ་འགྱེད་པ་ཡི་ནད་ན་འམ།
en: They will not suffer from disease or ailments, and just as a lotus is not soiled by muddy water, They will never be soiled by any evil.

source: །འཐབ་བམ་འགྱེད་པའམ་རྩོད་པ་ན། །ལན་ཐེབས་རྟག་ཏུ་རྒྱལ་བར་ནི།
en: They will be safe in the midst of a battle, in an armed conflict, during quarrels, disputes, and discord and will always emerge victorious.

source: །ཐོབ་པར་འགྱུར་ཏེ་ཐེ་ཙོམ་མེད།
en: There is no doubt about this. “

source: །དེ་ནས་རྫས་ནི་བཤད་བྱ་སྟེ། །སྨན་ནི་བཀྲ་ཤིས་དང་ལྡན་པ། །གྲུབ་པའི་མཐའ་སྟེ་མཆོག་ཏུ་གཙང་། །འཇིག་རྟེན་མགོན་དང་མཉམ་པར་གསུངས། ཨ་ག་རུ་དང་། ཙནྡན་དང་། པདྨ་དང་། ཨུཏྤལ་དང་། ཤི་རི་ཤའི་མེ་ཏོག་དང་། ཨ་བཱ་མརྒ་དང་། མེ་རུ་དང་།
en: Now I will list the power ingredients of the pill, whose perfect formula, which includes beneficial medicinal substances, is a supreme secret taught by the Lokeśvara himself.

source: ན་ལ་ད་དང་། ཆུ་སྲིན་གྱི་སེན་མོ་དང་། ཀ་ན་ཀའི་འབྲས་བུ་དང་། ཙནྡན་གྱི་འབྲས་བུ་དང་། །པདྨའི་འབྲས་བུ་དང་། རྡོ་དྲེག་དང་། མེད་དང་། བཙོད་དང་། སཱུ་ཀ་རི་དང་། མ་ཀ་ཊཱི་དང་། ཛཱ་ཡ་དང་། བི་ཛཱ་ཡ་དང་། པ་རི་པེ་ལ་པ་དང་། ར་ས་དང་། བཱི་རཱ་དང་། དྷྱ་མ་ཀ་དང་། རྒྱ་སྤོས་དང་། བུ་སཱ་དང་། ཨ་པར་ཏ་ཀ་དང་། རུ་རྟ་དང་། བྱ་གྲན་ཁ་དང་། པད་ཏྲ་དང་། ཏྲ་ཙ་དང་། ཀ་དམར་རཱ་དང་། པྲི་ཡང་ཀུ་དང་། གིའུ་ཝང་དང་། སྤྲྀ་ཀ་དང་། སྨྱིག་རྐང་དང་། ཡུངས་ཀར་དང་། ནཱ་ག་པུཥྤ་དང་། ཨེ་ལཱ་དང་། ལྡོང་རོས་དང་། གུར་གུམ་དང་། ག་པུར་དང་། གླ་རྩི་དང་། སྤང་སྤོས་དང་། ན་ལེ་ཤམ་དཀར་པོ་དང་། སུ་མ་དང་། ཉེའུ་ཤིང་དང་། ཤུ་ཏི་དང་། སྦྲང་རྩི་དང་། ཙམ་པ་ཀ་སྟེ།
en: The ingredients are agarwood, sandalwood, lotus, blue lotus, śirīṣa blossoms, chaff flower, meru, nalanda, nakha, kanakaphala, the seeds of sandal tree, lotus seeds, benzoin, meda, jihvā, sūkarī, markaṭī, jayā, vijayā, paripelava, rasa, vīrā, śāmaka, tagara, busā, āvartaka, costus, vyāghranakha, pattra, cinnamon bark, kaṭambharā, beautyberry, bovine bezoar, fenugreek, bamboo juice, mustard seeds, the blossom of nāgapuṣpa, cardamom, realgar, saffron, camphor, musk, māṃsī, white pepper, sumanas, wild asparagus, śatapuṣpa, sarvākṣī, and champak.

source: དེ་བཞིན་རྫས་ནི་དེ་དག་ཀུན། །སུ་བར་ཎ་ནི་དཀར་པོས་སྦྱར། །རིལ་བུ་ནམ་གཅིག་ཙམ་དུ་ནི། །སྐྱེས་བུ་མཁས་པས་བྱ་བ་ཡིན། །སུ་བར་ཎས་ནི་བཀབ་ནས་སུ།
en: The learned vidyā holder should combine all these ingredients with white gold, form them into a pill, and coat the pill in gold.

source: །རྫས་རྣམས་བསྲེས་ནས་སྦྱར་བར་བྱ།
en: The pill is now ready in terms of the ingredients. “

source: །ཆ་རྣམས་འཕེལ་བར་བྱ་བ་སྟེ། །གླ་རྩི་ཡིས་ནི་དྲི་བསྐྱེད་དོ། །ཕྱེ་མ་ཞིབ་མོར་བཏགས་ནས་སུ། །ཙནྡན་དཀར་པོའི་ཆུ་སྦྱར་ནས།
en: He should then combine the pill with musk to increase its volume, and ‘awaken’ it by steeping it in water infused with finely ground white sandalwood.

source: །གྲིབ་མ་ལ་ནི་བསྐམ་པར་བྱ།
en: He should then dry the pill in the shade.

source: །ཚེས་བརྒྱད་ནས་ནི་བརྩམས་ནས་སུ། །ཚེས་ནི་བཅྭ་ལྔ་ཉ་ཡི་བར། །ཉིན་གཅིག་བཞིན་དུ་དོན་ཡོད་པའི། །རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་སོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ཉིན་གཅིག་བཞིན།
en: Starting on the eighth lunar day and all through the fifteenth, full moon day, the vidyā holder should recite the Amogharāja one hundred and eight times every day.

source: །ལན་བདུན་བར་དུ་དབང་བསྐུར་རོ། །ཕྱག་རྒྱས་དབང་བསྐུར་བར་ཡང་བྱ། །དེ་ནས་ཚེས་ནི་བཅྭ་ལྔ་སྟེ། །ཉ་ལ་ཆུ་དང་ཡུངས་ཀར་དག །
en: He should consecrate the pill every day by reciting the Krodharāja seven times while displaying the consecration mudrā and while sprinkling water and mustard seeds on the pill.

source: དཀྱིལ་འཁོར་དུ་ནི་གཞག་པར་བྱ།
en: On the fifteenth, the day of the full moon, he should place the pill in the maṇḍala. “

source: །དེ་ནས་ནོར་བུའི་རྒྱལ་པོ་དང་། །གཞག་པའི་དཀྱིལ་འཁོར་བཤད་པར་བྱ། །ཆ་རྣམས་མ་ནོར་ལེགས་པར་དབྱེ།
en: Now I will teach on the maṇḍala and how to place the king of jewels within it.

source: །རྒྱར་ནི་ཀོ་ལའི་ཚད་དུ་བྱ།
en: The vidyā holder should demarcate a four-sided maṇḍala, with all its parts correct and complete and with a surface area the same as a boat.

source: །ཤིན་ཏུ་འཇམ་ལ་ཕྱི་བདར་ལེགས།
en: It should be wiped clean and be smooth and soft.

source: །ཚོན་རྩི་སྣ་ཚོགས་མཛེས་པ་དང་། །དཀྱིལ་འཁོར་མཆོག་ནི་ཐིག་གདབ་བོ།
en: This supreme maṇḍala should be measured out with a string, and its symmetrical sections fully painted with different colors.

source: །སྒོ་བཞི་གདོད་ཅིང་གྲྭ་བཞི་གདོད། །ཀུན་ནས་ཤིན་ཏུ་ཆ་ཕྱེ་ཞིང་། །དཀྱིལ་འཁོར་སྙིང་པོ་ཆ་ཕྱེ་བ། །ཚད་དང་ཤིན་ཏུ་ལྡན་པར་བྱ།
en: It should have four carefully measured doors and corners.

source: །པདྨ་ཆེན་པོ་བཞི་དག་དང་། །དེ་བཞིན་ཕྱག་དང་སྤྱན་དུ་བཅས། དོན་ཡོད་དངོས་གྲུབ་བྲི་བར་བྱ། །ནོར་བུ་རྒྱལ་པོ་འཆང་བ་ཡིས།
en: The vidyā holder should draw the four great lotuses that are amogha-complete with ‘eye-hands’ that hold a jewel.

source: །ཕྱག་རྒྱར་བཅས་པ་བྲི་བར་བྱ། །ཆུ་ཡི་རྒྱ་མཚོའི་ནང་དུ་ནི། །ལས་ཀྱིས་རྡོ་རྗེ་ལེགས་པར་བྲི།
en: He should draw the ocean and, in the midst of this body of water, the vajra of activity.

source: །དཀྱིལ་འཁོར་སྙིང་པོ་དམ་པ་ལ། །ཀུན་ནས་ཁ་ཁྱེར་རྣམ་པ་དང་། །མེ་ཏོག་སྣ་ཚོགས་པ་དག་བྲི། །དཀྱིལ་འཁོར་ཕྱི་རོལ་ཀུན་དུ་ནི།
en: This supreme maṇḍala should be surrounded with a railing and strewn internally with various bright flowers.

source: །ནོར་བུ་པདྨ་ལེགས་པར་བྲི།
en: The vidyā holder should draw a row of jeweled lotuses surrounding the outside of the maṇḍala. “

source: །སྒོ་བཞི་ཡི་ནི་གནས་རྣམས་སུ། །པདྨ་ཞགས་པ་མདུང་རྩེ་གསུམ། །རྡོ་རྗེའི་ཚུལ་མཆོག་ལེགས་པར་བྲི། །གྲྭ་བཞི་ཡི་ནི་གནས་རྣམས་སུ། །ལག་ན་ནོར་བུ་ཡོད་པ་བྲི། །པདྨའི་སྟེང་ན་རབ་ཏུ་གནས།
en: At each of the four doors the vidyā holder should draw a lotus noose, a trident, and the supreme form of vajra, and in each of the four corners, a hand supported by a lotus and holding a jewel.

source: །དཀྱིལ་འཁོར་བཟང་པོ་ཕན་ཕྲན་དང་། །བུམ་པ་བཀང་དང་མེ་ཏོག་དང་། །བདུག་པ་འབྲས་བུ་རྣམས་ཀྱིས་བརྒྱན། །གཏོར་མ་རྣམ་པ་སྣ་ཚོགས་དག །ཅི་བདོག་བུངས་ཆེར་གཞག་པར་བྱ། །ཀུན་དུ་མར་མེ་ཕྲེང་བ་དང་།
en: He should adorn the maṇḍala with divine banners and full jars, skillfully arrange whatever incense, fruit, and various bali articles are available, and place rows of lamps all around.

source: །མཆོད་ཡོན་ཆུ་དང་ཨ་ག་རུ། །ཙནྡན་བདུག་སྤོས་དབུལ་བར་བྱ།
en: He should offer argha water for the feet and burn divine incense of agarwood and sandalwood. “

source: །ནོར་བུ་རྒྱལ་པོ་འཇིགས་མེད་པ། །སྣོད་བཟང་ལེགས་པར་བཀང་ནས་སུ། །རྒྱ་དར་ལ་ཡིས་ཁ་གཡོགས་ཏེ། །དཀྱིལ་འཁོར་དེ་ཉིད་རིག་པས་གཞག །
en: The skilled vidyā holder who knows the nature of reality should place the king of jewels in a divine bowl, cover it with a piece of Chinese silk, and place the bowl in the maṇḍala.

source: དཀྱིལ་འཁོར་སྙིང་པོར་འཇིག་རྟེན་དབང་། །གཞག་སྟེ་དེ་ནས་ལས་རྡོ་རྗེ། །སྣོད་ཀྱི་སྟེང་དུ་བཞག་པ་ནི། །ནོར་བུ་དཀྱིལ་འཁོར་བྱ་བ་ཡིན།
en: He should place an image of the Lokeśvara in the center of the maṇḍala, and the vajra of activity on top of the bowl where the king of jewels is.

source: དེ་ནས་རིག་སྔགས་འཆང་གིས་དོན་ཡོད་པའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱ། ཁྲོ་བོའི་རྒྱལ་པོས་ལན་བདུན་དབང་བསྐུར་བར་བྱ།
en: He should then recite the Amogharāja twenty-one times and consecrate the jewel while reciting the Krodharāja seven times.

source: དེ་ནས་གསང་སྔགས་ཡི་གེ་གཅིག་པོ་འབུམ་ཚང་བར་བཟླས་བརྗོད་བྱ་སྟེ།
en: After that, he should recite the one-syllable mantra one hundred thousand times.

source: འབུམ་བཟླས་བརྗོད་བྱས་ན་ནོར་བུའི་རྒྱལ་པོ་འབར་བར་འགྱུར་རོ།
en: When this number of recitations has been reached, the king of jewels will blaze with light. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གི་ལག །གཡས་དང་ལྡན་པས་བཟུང་ནས་ནི། །ཆང་པ་དམ་དུ་བསྡམ་པར་བྱ།
en: At that moment, the vidyā holder should grasp the jewel with his right hand and squeeze it in his fist.

source: །བསྡམས་པ་ཙམ་གྱི་མོད་དག་ལ། །རྫུ་འཕྲུལ་གྱིས་ནི་མཁའ་ལ་འགྲོ། །ནོར་བུ་དྲི་མ་མེད་པ་དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་བཀོད་པ་ཞེས་བྱ་བ། རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བ་འཐོབ་ལ་འཁོར་རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བ་བྱེ་བ་ཕྲག་འབུམ་ཡོད་པར་འགྱུར།
en: As soon as he squeezes it, he will magically rise into the air and become a vidyādhara emperor by the name of Marvelous Amogha Display of the Pure Jewel, with a retinue of hundreds of thousands of millions of other vidyādhara emperors.

source: ཁུང་གི་སྒོ་ཐམས་ཅད་ཕྱེ་བར་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཕྱེ་བར་འགྱུར།
en: The doors to terrestrial passages will fall open for him, as will all buddha fields.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དག་ཁ་ཏོན་དུ་ལོབས་པར་འགྱུར།
en: All the mudrās and the maṇḍalas that form a connection to all the tathāgata families will remain right in front of him.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འཇུག་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་བ་དང་། འདུད་པ་དག་གིས་གསོང་པོར་སྨྲ་བར་བྱེད། ཐམས་ཅད་དུ་ཡང་དོན་ཡོད་པའི་དཀྱིལ་འཁོར་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་ཐོབ་པར་འགྱུར།
en: He will be able to enter every buddha field and greet, salute, and pay homage to every tathāgata, from each of whom he will hear a teaching that constitutes a maṇḍala of liberation.

source: ཚེ་བསྐལ་པ་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་སུ་རིང་བར་འགྱུར།
en: His lifespan will increase to seventy-two times a hundred thousand eons.

source: དོན་ཡོད་པའི་པདྨའི་འཁོར་ལོ་བདུན་ནས་འགྲོ་བར་འགྱུར་རོ།
en: An amogha lotus wheel will run in front of him. “

source: །གལ་ཏེ་འབར་བར་མ་གྱུར་ན་སྔར་བསྟན་པའི་ཡོན་ཏན་གྱི་ཁྱད་པར་རྣམས་ཐོབ་པར་འགྱུར་ལ།
en: If, however, the jewel does not blaze, the vidyā holder will obtain the special qualities as previously explained.

source: མཉམ་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བའི་ནོར་བུ་རྒྱལ་པོའི་རིལ་བུ་ནི་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ལས་རྣམས་སྒྲུབ་པ་ཡིན་ནོ།
en: This pill, the king of jewels, is equal to the Tathāgata in every respect. It can accomplish activities both worldly and supramundane.

source: །ཚེ་བརྗེས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ལ། གང་དང་གང་དུ་སྐྱེ་བའི་ཚེ་རབས་ཐམས་ཅད་དུ་ཚེ་རབས་དྲན་པར་འགྱུར།
en: When the time comes to take another birth, the vidyā holder will be reborn in the realm of Sukhāvatī and will be able to remember his previous births, wherever they occurred.

source: ནོར་བུའི་རིལ་བུ་འདི་མཐོང་བ་ཙམ་གྱིས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་མངོན་སུམ་དུ་མཐོང་ཞིང་བལྟ་བར་འགྱུར། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མངོན་དུ་མཐོང་ཞིང་རྟག་ཏུ་བལྟ་བར་འགྱུར།
en: As soon as the vidyā holder sees the jewel pill, he will obtain a direct vision of the tathāgatas of the three times and will directly perceive Noble Avalokiteśvara.

source: རིལ་བུ་རང་གི་ལུས་ལ་ཡོད་པ་དེ་ཡང་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: The person who carries this pill on his body should be known as one who is established irreversibly on the path to awakening.

source: །དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོ་མཆོད་རྟེན་དང་མཉམ་པ་ཞེས་བྱ་བ་སྟེ།
en: He is said to be the same as a stūpa containing the relics of the Tathāgata.

source: འདི་ལ་སོམ་ཉི་དང་ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱའོ།
en: This should not be doubted or questioned. “

source: །མཐོང་བ་དང་རེག་པ་ཙམ་གྱི་མོད་ལ་སྔོན་གྱི་ལས་ཀྱི་སྒྲིབ་པ་གྲངས་དང་བགྲང་བའི་ཚུལ་གྱིས་བསྐལ་པ་འབུམ་དུ་བསགས་པ།
en: As soon as the pill is seen or touched, all previous karmic obscurations accumulated throughout hundreds of thousands of eons will be exhausted by the power of the blessed tathāgatas of the three times, the worthy, fully realized buddhas.

source: མནར་མེད་པའི་གནས་སུ་འགྲོ་བར་འགྱུར་བ། མཚམས་མེད་པ་ལྔ་བྱེད་པ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། དམ་པའི་ཆོས་སྤོང་བ་དེ་དག་ཐམས་ཅད་དུས་གསུམ་གྱི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཐུ་དང་།
en: This includes the obscurations that would result in rebirth in the Avīci hell, including the five acts of immediate retribution, slandering the noble ones, or rejecting the true Dharma.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ནོར་བུའི་རྒྱལ་པོའི་མཐུས་ཐམས་ཅད་ཟད་པར་འགྱུར།
en: They will all be exhausted by the power of the king of jewels of Noble Avalokiteśvara.

source: སེམས་ཅན་དམྱལ་བའི་འགྲོ་བདག་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར། བདེ་འགྲོའི་ལམ་ལ་གཞོལ་བར་འགྱུར།
en: Beings with such karma will be saved from rebirth in hell, and they will inevitably enter the path of the sugatas.

source: ཚེ་བརྗེས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: When taking a new birth, they will be born in the realm of Sukhāvatī. “

source: །དེ་ལྟ་བས་ན་ལེགས་པར་སྒྲུབ་པ་མཐར་ཐུག་པར་བྱ་ཞིང་བསྒྲུབ་པར་བྱ།
en: One should therefore perform the practice thoroughly and in full until it is accomplished.

source: མཐུ་སྟོབས་ཀྱིས་སྦྱར་བར་བྱ། ཤིན་ཏུ་གསལ་ཞིང་རབ་ཏུ་གསལ་བའི་བསམ་པ་འབད་པས་སྦྱར་བར་བྱ།
en: Whether one is weak or strong, one should apply oneself strenuously with a clear and definite intention.

source: རང་གི་ཤ་དང་ཁྲག་ཀྱང་ཡོངས་སུ་བཏང་ནས་བཙལ་བར་བྱ་ཞིང་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཡོངས་སུ་བཙལ་བར་བྱ་བ་ཡིན་ན་ཕྱི་རོལ་གྱི་དངོས་པོ་ནོར་དང་། འབྲུ་དང་།
en: One must seek the accomplishment of this sovereign ritual, sacrificing even one’s own flesh and blood, let alone material goods, in pursuit of the goal.

source: དབྱིག་དང་། གསེར་དང་། དངུལ་དང་། གོས་དང་། རྒྱན་རྣམས་ཡོངས་སུ་བཏང་ནས་ཡོངས་སུ་བཙལ་བར་བྱ་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: One should sacrifice money, grain, wrought gold, gold coins, silver, clothes, and adornments in pursuit of the goal.

source: སྲོག་གཏང་བར་བྱའི་དེ་གཏང་བར་མི་བྱའོ།
en: One should pursue the goal even at the cost of one’s life.

source: །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་རིམ་པར་ཕྱེ་བ་སྒྲུབ་པ་འདི་བཙལ་བར་བྱ་ཞིང་བསྒྲུབ་པར་བྱའོ།
en: One should seek the accomplishment of the practice of the heart essence of Amoghapāśa, this maṇḍala of liberation.

source: །འདིའི་དུས་ཕྱི་མའི་ཚེ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར།
en: This practice will fulfill, for all beings, the work of the Buddha during the final period, the final time.

source: སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པ་ཉིད་ཀྱི་དད་པས་སངས་རྒྱས་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: All beings with genuine faith will fully awaken to the state of buddhahood.

source: ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ནམས་ཀྱང་ངན་འགྲོ་ལོག་པར་འགྲོ་བར་མི་འགྱུར་རོ།
en: They will reach the level of not turning back, and they will never fall into the lower realms again. “

source: །ནོར་བུའི་རིལ་བུ་སྒྲུབ་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the maṇḍala of the practice procedure of the precious pill. “

source: དེ་ནས་དེའི་ཕྱིར་དོན་ཡོད་པ་ཡངས་པའི་དཀྱིལ་འཁོར་ཆེན་པོ་དོན་ཡོད་པ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པའི་དངོས་གྲུབ་ཀྱི་སྨན་ནོར་བུ་དང་། གསང་སྔགས་རྣམས་བཤད་པར་བྱ་སྟེ།
en: Now I will teach the medicinal jewel, a great amogha accomplishment that magically arises out of the vast and great amogha maṇḍala, together with the relevant mantras.
